Store/src/Documents/ПоступлениеТовара/ПоступлениеТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТовара</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Store/src/Documents/ПоступлениеТовара/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЧтоПоменялось = "Цена";
	
	РассчитатьСумму(ТекущиеДанные, ЧтоПоменялось);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЧтоПоменялось = "Количество";
	
	РассчитатьСумму(ТекущиеДанные, ЧтоПоменялось);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСумму(Строка, ТекстСообщения)
	Строка.Сумма = Строка.Количество * Строка.Цена;
	Сообщить(ТекстСообщения);
	
	ПОльзователь = ОписаниеЧеловека();
	Сообщить(Пользователь.Имя);
	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеЧеловека()
	
	Описание = Новый Структура();
	Описание.Вставить("Имя", "Антон");
	Описание.Вставить("Дата", ТекущаяДата());
	Описание.Вставить("Уволен", Ложь);
	Описание.Вставить("Стаж", 14);
	Возврат Описание;
		
КонецФункции

#КонецОбласти
